{
  "main": {
    "name":"Jayvon Heyliger",
    "description":"I am a web development engineer and I use React to develop pages. This project will also be availble via my GitHub if you would like to view the source code.",
    "image":"profilepic.jpg",
    "bio":"I have recently graduated from Kean University in Information Technology. Currently, I use my time and resources to research and work on developing new projects. My goal for the near future is to land my first official development job. My dream is utilize my passion for coding to influence others and later allow allow me to work all around the world.",
    "contactmessage":"Please feel free to contact me by phone or email",
    "email": "jaheyliger@yahoo.com",
    "phone": "(973) 454-8557",
    "github":"https://github.com/jaheyliger/",
    "project":"https://github.com/jaheyliger/jayvonh.com",
    "address":{
      "street":"",
      "city":"Hillside",
      "state":"NJ",
      "zip": "07205"
    },
    "website": "http://www.jayvonh.com",
    "resumedownload":"https://drive.google.com/file/d/1HQZzWFYRYsI6BaJZrYeRB4wLt1ZyGonz/view?usp=sharing",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/jayvon-heyliger",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/jaheyliger",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/jaheyliger",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here are some of my favorite tools and technologies to work with",
    "education":[
      {
        "school":"Kean University",
        "degree":"Bachelors in Information Technology",
        "graduated":"January 2020",
        "description":"Here I took my Bacholors of Information Tecnology with a Cybersecurity Specialty and achieved a more thorough understanding of the concepts and science behind complex programming and security on the web. During this journey, I discovered my passion for developing scalable applications (web and mobile) and the security behind computer and application systems."
      },
      {
        "school":"Zero to Mastery",
        "degree":"Certification of Completion",
        "graduated":"December 2020 - Present",
        "description":"Software Eningeering courses in the areas of React development and Python programming. These course helped me to furter my understanding of software engineering and strive to acheive my career goals."
      },
      {
        "school":"Revature Spark Training",
        "degree":"Certification of Completion",
        "graduated":"November 2020",
        "description":"Software Engineering Training focused around Web Development languages, SQL, and Java. This included five projects designed to challenge, assess, and implement all of the material from the lectures and transform them into usable applications."
      }
    ],
    "work":[
      {
        "company":"NBCUniversal",
        "title":"Desktop Support Engineer",
        "years":"March 2020 - Present",
        "description":"While working for NBCU I performed a ranged of tasks including, but not limited to, imaging laptops, Mac software installation, domain management, VPN configuration, secure discarding of sensitive data, and troubleshooting."
      },
      {
        "company":"Freelance",
        "title":"Web Designer",
        "years":"December 2020 - January 2020",
        "description":"Collaborated with clients to create a UI/UX design for an commerce site that they were looking to build"
      }
    ],
    "skills":[
      {
        "name":"ReactJs",
        "description":"React is by far my framework of choice for developing front end UI design. This site itself is made possible by using React.",
        "image":"react.png"
      },
      {
        "name":"NodeJs",
        "description":"The bulk of my experience has been with Node JS and it is my server-side scripting language of choice.",
        "image":"node.png"
      },
      {
        "name":"SASS",
        "description":"SASS is provides a new way of thinking when developing CSS. I find that nesting and using partials make it easier to keep track of whats changing with CSS, especially when used on larger projects.",
        "image":"sass.png"
      },
      {
        "name":"Java",
        "description":"Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image":"java.png"
      },
      {
        "name":"Figma",
        "description":"Figma is by far one of favorite tools to use when prototyping a new UI design. I find this tool to be perfect for me to express my creative vision.",
        "image":"figma.png"
      },
      {
        "name":"Swift",
        "description":"I was introduced to Swift while creating an iOS app for my University Senior Capstone Project. I sought out to challenge myself to learn a new programming language and in the end, i discovered a new interest in developing mobile applicaions.",
        "image":"swift.png"
      },
      {
        "name":"MongoDB",
        "description":"MongoDB has proved to suit my needs when I began to get interested in MERN Full Stack Development due to its ease of use and its enjoyable to work with",
        "image":"mongodb.png"
      },
      {
        "name":"SQL",
        "description":"MySQL was my first introduction to a relational database system when I created a project while during my time in University. ",
        "image":"sql.png"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Portfolio",
        "category":"One of my previous portfolio designs",
        "image":"portfolio.jpg",
        "url":"http://www.jayvonheyliger.com"
      },
      {
        "title":"Omnifood",
        "category":"Concept for a meal delivery service",
        "image":"omnifood.jpg",
        "url":"http://www.jayvonheyliger.com/Omnifood/index.html"
      },
      {
        "title":"University Database Project",
        "category":"(Offline Now) Employe Database Login",
        "image":"database.jpg",
        "url":"http://eve.kean.edu/~heyligej/TECH3720/login.html"
      }
    ]
  }
}
